

变量x = -> 打印 什么

_无效变量 = ->

_无效变量 = -> -> ->

到 谷 仓 去

开 -> 这扇 -> 门

开 ->
	这扇 门
	你好 = ->
		我的 函数

变量h = -> 👋

吃 ->, 世界


(->)()

变量x = (...) ->

你好!
你好.世界!

_无效变量 = 你好!.某物
_无效变量 = 什么!["🥵🥵🥵"]

什! 么! 情况!

_无效变量 = (参数a,参数b,参数c,参数d,参数e) ->

_无效变量 = (参数,参数,参数,参数,参数) ->
	打印 参数

_无效变量 = (参数x=23023) ->

_无效变量 = (参数x=(参数y=()->) ->) ->

_无效变量 = (变量x = if 某物 then 好 else 坏) ->

某物 = (你好=100, 世界=(参数x=[[好 酷]])-> 打印 "吃米饭") ->
	打印 你好

_无效变量 = () =>
_无效变量 = (参数x, 参数y) =>
_无效变量 = (@参数x, @参数y) =>
_无效变量 = (参数x=1) =>
_无效变量 = (@参数x=1,参数y,@参数z="你好 世界") =>


变量x -> return
变量y -> return 1
变量z -> return 1, "你好", "世界"
变量k -> if 是 then return else return

_无效变量 = -> 真名 if 某物

--

函数d(
	->
		打印 "你好 世界"
	10
)



函数d(
	1,2,3
	4
	5
	6

	if 某物
		打印 "okay"
		10

	10,20
)


函数f(
	
	)(
	
	)(
		什么
	)(->
		打印 "srue"
	123)

--

变量x = (参数a,
	参数b) ->
	 打印 "什么"


变量y = (参数a="hi",
	参数b=23) ->
		打印 "什么"

变量z = (
	参数a="hi",
	参数b=23) ->
		打印 "什么"


变量j = (参数f,参数g,参数m,
	参数a="hi",
	参数b=23
) ->
		打印 "什么"


变量y = (参数a="hi",
	参数b=23,
	...) ->
		打印 "什么"


变量y = (参数a="hi",
	参数b=23,
	...
) ->
		打印 "什么"

--

多参数 = (参数a
	参数b) ->
		打印 "什么"


多参数 = (参数a="hi"
	参数b=23) ->
		打印 "什么"

多参数 = (
	参数a="hi"
	参数b=23) ->
		打印 "什么"


多参数 = (参数f,参数g,参数m
	参数a="hi"
	参数b=23
) ->
		打印 "什么"


@ = (参数n)->
	return 1 if 参数n == 0
	参数n * @(参数n-1)

nil
